src/docker/kubernates-handbook/theory/service/ingress.org
#+TITLE: Ingress 
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/main.css" />
#+HTML_LINK_UP: toplogy.html
#+HTML_LINK_HOME: index.html
#+OPTIONS: num:nil timestamp:nil ^:nil

_Ingress_ 是从 _Kubernetes 集群外部_ 访问 _集群内部服务_ 的入口。先澄清几个术语：
+ _节点_ ：Kubernetes 集群中的一台物理机或者虚拟机
+ _集群_ ：位于 Internet 防火墙后的节点
  #+begin_example
    这是 kubernetes 管理的主要计算资源
  #+end_example
+ _边界路由器_ ：为集群强制执行防火墙策略的路由器
  #+begin_example
    这可能是由云提供商或物理硬件管理的网关
  #+end_example
+ _集群网络_ ：一组逻辑或物理链接，可根据 Kubernetes 网络模型实现集群内的通信
  #+begin_example
    集群网络的实现包括 Overlay 模型的 flannel 和基于 SDN 的 OVS
  #+end_example
+ _服务_ ：使用标签选择器标识一组 pod 成为的 Kubernetes 服务
  #+begin_example
    除非另有说明，否则服务假定在集群网络内仅可通过虚拟 IP 访问
  #+end_example

#+begin_example
  接下来还会讲到使用 Traefik 来做 Ingress controller，并给出了几个相关链接
#+end_example

* 定义
