html/docker/kubernates-handbook/theory/service/ingress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ingress</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="toplogy.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Ingress</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org192586e">定义</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">Ingress</span> 是从 <span class="underline">Kubernetes 集群外部</span> 访问 <span class="underline">集群内部服务</span> 的入口。先澄清几个术语：
</p>
<ul class="org-ul">
<li><span class="underline">节点</span> ：Kubernetes 集群中的一台物理机或者虚拟机</li>
<li><p>
<span class="underline">集群</span> ：位于 Internet 防火墙后的节点
</p>
<pre class="example" id="org5085062">
这是 kubernetes 管理的主要计算资源
</pre></li>
<li><p>
<span class="underline">边界路由器</span> ：为集群强制执行防火墙策略的路由器
</p>
<pre class="example" id="org2f66452">
这可能是由云提供商或物理硬件管理的网关
</pre></li>
<li><p>
<span class="underline">集群网络</span> ：一组逻辑或物理链接，可根据 Kubernetes 网络模型实现集群内的通信
</p>
<pre class="example" id="org2b4714c">
集群网络的实现包括 Overlay 模型的 flannel 和基于 SDN 的 OVS
</pre></li>
<li><p>
<span class="underline">服务</span> ：使用标签选择器标识一组 pod 成为的 Kubernetes 服务
</p>
<pre class="example" id="org940e528">
除非另有说明，否则服务假定在集群网络内仅可通过虚拟 IP 访问
</pre></li>
</ul>

<pre class="example" id="orge2b2aa8">
接下来还会讲到使用 Traefik 来做 Ingress controller，并给出了几个相关链接
</pre>

<div id="outline-container-org192586e" class="outline-2">
<h2 id="org192586e">定义</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
